In [2]:
#importing the necessary libraries
import numpy as np
import pandas as pd

#read the dataset
box_scores = pd.read_csv('Assignment_marks.csv')

In [3]:
#quick look at our dataset
box_scores.head()

        student  assignment1  assignment2  assignment3
0  Karen Austin           90           98           80
1   Mathew Ward           85           90           70
2  John Miranda           87           75           90
3  Scott Taylor           60           55           70
4  Tom Saunders           80           88           90

# **QUIZ.**

# You are given a table containing assignment scores of students in a class. Write a query that identifies the largest difference in total score of all assignments.
#Output just the difference in total score between the two students.

In [16]:
#find the sum of scores along the rows
list_columns = box_scores.loc[:,['assignment1', 'assignment2', 'assignment3']]

total_score = list_columns.sum(axis=1)

#creating a new column total_scores
box_scores['total_score'] = total_score
box_scores

        student  assignment1  assignment2  assignment3  total_score
0  Karen Austin           90           98           80          268
1   Mathew Ward           85           90           70          245
2  John Miranda           87           75           90          252
3  Scott Taylor           60           55           70          185
4  Tom Saunders           80           88           90          258

In [17]:
#find the lowest total score

lowest_total_score = box_scores.total_score.min()
lowest_total_score

185

In [18]:
#find the highest total score

highest_total_score = box_scores.total_score.max()
highest_total_score

268

In [19]:
#differenece between lowest and highest total scores
difference_total_score = (highest_total_score - lowest_total_score)
difference_total_score

83